INSERT INTO wishlists (id, owner_id, title, description, is_public, created_at, updated_at)
VALUES
('10000000-0000-0000-0000-000000000000', '10000000-0000-0000-0000-000000000000', 'На ДР', 'То что хочу на день рождения', true, '2026-02-27T13:02:02.468+02:00', '2026-02-27T13:02:02.468+02:00'),
('20000000-0000-0000-0000-000000000000', '10000000-0000-0000-0000-000000000000', 'На НГ', 'То что хочу на новый год', true, '2026-02-27T13:02:02.468+02:00', '2026-02-27T13:02:02.468+02:00'),
('30000000-0000-0000-0000-000000000000', '10000000-0000-0000-0000-000000000000', 'На День святого патрика', 'То что хочу на День святого патрика', true, '2026-02-27T13:02:02.468+02:00', '2026-02-27T13:02:02.468+02:00'),
('40000000-0000-0000-0000-000000000000', '10000000-0000-0000-0000-000000000000', 'Личное', 'То что хочу сам себе купить', false, '2026-02-27T13:02:02.468+02:00', '2026-02-27T13:02:02.468+02:00'),

('50000000-0000-0000-0000-000000000000', '20000000-0000-0000-0000-000000000000', 'На ДР', 'То что хочу на день рождения', true, '2026-02-27T13:02:02.468+02:00', '2026-02-27T13:02:02.468+02:00'),
('60000000-0000-0000-0000-000000000000', '20000000-0000-0000-0000-000000000000', 'На НГ', 'То что хочу на новый год', true, '2026-02-27T13:02:02.468+02:00', '2026-02-27T13:02:02.468+02:00'),
('70000000-0000-0000-0000-000000000000', '20000000-0000-0000-0000-000000000000', 'На День святого патрика', 'То что хочу на День святого патрика', true, '2026-02-27T13:02:02.468+02:00', '2026-02-27T13:02:02.468+02:00'),
('80000000-0000-0000-0000-000000000000', '20000000-0000-0000-0000-000000000000', 'Личное', 'То что хочу сам себе купить', false, '2026-02-27T13:02:02.468+02:00', '2026-02-27T13:02:02.468+02:00');

INSERT INTO items (id, wishlist_id, name, description, image_url, product_url, price, booked_by, booked_at, created_at, updated_at)
VALUES
('10000000-0000-0000-0000-000000000000',
'10000000-0000-0000-0000-000000000000',
'PlayStation 5 Slim',
'PlayStation 5 Slim', 
'https://c.dns-shop.ru/thumb/st1/fit/wm/0/0/562a40c7aaf0eea137a4e201fe74912d/84cf1a12a3a79953cebfba38182df1a14449d71d52da68cbcfdffc594cfd6bf8.jpg.webp',
'https://www.dns-shop.ru/product/3d1b360e98ebd582/igrovaa-konsol-playstation-5-slim/', 
5099900,
'20000000-0000-0000-0000-000000000000',
'2026-02-27T13:02:02.468+02:00',
'2026-02-27T13:02:02.468+02:00',
'2026-02-27T13:02:02.468+02:00'
),
('20000000-0000-0000-0000-000000000000',
'10000000-0000-0000-0000-000000000000',
'Steam Deck',
'Портативная игровая консоль Steam Deck OLED 1024 ГБ', 
'https://c.dns-shop.ru/thumb/st4/fit/wm/0/0/1d6ab5e8e8489ea8f4828b30b6f2dbc7/2b2c9fcad6869829aefa2024ae5c07e03321376085bb672ea0f96d8ece8ab680.jpg.webp',
'https://www.dns-shop.ru/product/28fe2a7288e7ed20/portativnaa-igrovaa-konsol-steam-deck-oled-1024-gb/', 
7729900,
NULL,
NULL,
'2026-02-27T13:02:02.468+02:00',
'2026-02-27T13:02:02.468+02:00'
),
('30000000-0000-0000-0000-000000000000',
'50000000-0000-0000-0000-000000000000',
'PlayStation 5 Slim',
'PlayStation 5 Slim', 
'https://c.dns-shop.ru/thumb/st1/fit/wm/0/0/562a40c7aaf0eea137a4e201fe74912d/84cf1a12a3a79953cebfba38182df1a14449d71d52da68cbcfdffc594cfd6bf8.jpg.webp',
'https://www.dns-shop.ru/product/3d1b360e98ebd582/igrovaa-konsol-playstation-5-slim/', 
5099900,
NULL,
NULL,
'2026-02-27T13:02:02.468+02:00',
'2026-02-27T13:02:02.468+02:00'
),
('40000000-0000-0000-0000-000000000000',
'50000000-0000-0000-0000-000000000000',
'Steam Deck',
'Портативная игровая консоль Steam Deck OLED 1024 ГБ', 
'https://c.dns-shop.ru/thumb/st4/fit/wm/0/0/1d6ab5e8e8489ea8f4828b30b6f2dbc7/2b2c9fcad6869829aefa2024ae5c07e03321376085bb672ea0f96d8ece8ab680.jpg.webp',
'https://www.dns-shop.ru/product/28fe2a7288e7ed20/portativnaa-igrovaa-konsol-steam-deck-oled-1024-gb/', 
7729900,
'10000000-0000-0000-0000-000000000000',
'2026-02-27T13:02:02.468+02:00',
'2026-02-27T13:02:02.468+02:00',
'2026-02-27T13:02:02.468+02:00'
);